Repository: bnm-sys/codequest
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ne

source: CodeQuest
ne: कोडक्वेस्ट

source: Dashboard
ne: ड्यासबोर्ड

source: Logout
ne: लगआउट

source: Login
ne: लगइन

source: Register
ne: रेजिष्टर

source: Profile
ne: प्रोफाइल

source: View Profile
ne: प्रोफाइल हेर्नुहोस्

source: Your Profile
ne: तपाईंको प्रोफाइल

source: Role
ne: भूमिका

source: Language
ne: भाषा

source: Achievements
ne: उपलब्धिहरू

source: Total XP
ne: कुल XP

source: Max Streak
ne: अधिकतम निरन्तरता

source: Challenges Solved
ne: हल गरिएका चुनौतीहरू

source: Current Courses
ne: हालका कोर्सहरू

source: You haven't enrolled in any courses yet.
ne: तपाईंले अहिलेसम्म कुनै कोर्समा नाम दर्ता गर्नुभएको छैन।

source: Explore Courses
ne: कोर्सहरू अन्वेषण गर्नुहोस्

source: Enroll Now
ne: अहिले नाम दर्ता गर्नुहोस्

source: Create a new account
ne: नयाँ खाता बनाउनुहोस्

source: Already have an account?
ne: पहिल्यै खाता छ?

source: Welcome! Your account has been created.
ne: स्वागत छ! तपाईंको खाता तयार भयो।

source: Login to CodeQuest
ne: कोडक्वेस्टमा लगइन गर्नुहोस्

source: Username
ne: प्रयोगकर्ता नाम

source: Password
ne: पासवर्ड

source: Don't have an account?
ne: खाता छैन?

source: Register here
ne: यहाँ रेजिष्टर गर्नुहोस्

source: Home
ne: गृहपृष्ठ

source: NEXT-GEN TRAINING HUB
ne: नेक्स्ट-जेन प्रशिक्षण केन्द्र

source: Master Linux & Git like a space pilot.
ne: स्पेस पाइलटजस्तै लिनक्स र गिटमा दक्ष बन्नुहोस्।

source: Interactive missions, terminal-grade drills, and a trajectory built for real-world engineering.
ne: इन्टरेक्टिभ मिशन, टर्मिनल-ग्रेड अभ्यास, र वास्तविक इन्जिनियरिङका लागि बनाइएका चरणहरू।

source: Start the Quest
ne: यात्रा सुरु गर्नुहोस्

source: Explore courses
ne: कोर्सहरू हेर्नुहोस्

source: Live terminal labs
ne: लाइभ टर्मिनल ल्याब

source: Real OS sandboxes
ne: वास्तविक OS स्यान्डबक्स

source: Mission-based
ne: मिशन-आधारित

source: Progressive checkpoints
ne: क्रमिक चेकपोइन्ट

source: Signal strength
ne: सिग्नल बलियो

source: Community + leaderboard
ne: समुदाय र लिडरबोर्ड

source: Available Courses
ne: उपलब्ध कोर्सहरू

source: Curated for velocity, tuned for reliability.
ne: द्रुतगतिका लागि छनोट, भरपर्दोपनका लागि समायोजित।

source: Launch Module
ne: मोड्युल सुरु गर्नुहोस्

source: No courses available at the moment.
ne: अहिले कुनै कोर्स उपलब्ध छैन।

source: Track your progress, XP, and streaks.
ne: तपाईंको प्रगति, XP, र निरन्तरताहरू ट्र्याक गर्नुहोस्।

source: Your Courses
ne: तपाईंका कोर्सहरू

source: Progress
ne: प्रगति

source: Streak
ne: निरन्तरता

source: Total Minutes Spent
ne: कुल मिनेट खर्च

source: Continue Learning
ne: पढाइ जारी राख्नुहोस्

source: You are not enrolled in any course yet. Go <a href="{% url 'home' %}">home</a> to enroll.
ne: तपाईं कुनै कोर्समा नाम दर्ता गरिएको छैन। नाम दर्ता गर्न <a href="{% url 'home' %}">गृहपृष्ठ</a> जानुहोस्।

source: Enroll
ne: नाम दर्ता गर्नुहोस्

source: Modules
ne: मोड्युलहरू

source: Points
ne: अंक

source: No modules added yet.
ne: अहिलेसम्म कुनै मोड्युल थपिएको छैन।

source: Learning Center
ne: लर्निङ सेन्टर

source: Adaptive lessons, real-time feedback, challenge progression & sandbox access.
ne: अनुकूल पाठ, रियल-टाइम प्रतिकृया, चुनौती प्रगति र स्यान्डबक्स पहुँच।

source: Module Overview
ne: मोड्युल अवलोकन

source: Your personalized modules will appear here based on your challenge performance.
ne: तपाईंको चुनौती प्रदर्शनका आधारमा यहाँ व्यक्तिगत मोड्युलहरू देखिनेछन्।

source: SANDBOX TERMINAL
ne: स्यान्डबक्स टर्मिनल

source: Welcome to your practice environment...
ne: तपाईंको अभ्यास वातावरणमा स्वागत छ...

source: Your Progress
ne: तपाईंको प्रगति

source: days
ne: दिन

source: XP Earned
ne: आर्जित XP

source: Rank
ne: क्रम

source: Unranked
ne: क्रमविहीन

source: MORE MODULES UNLOCK AS YOU MASTER CHALLENGES ▬▬▶
ne: चुनौतीमा दक्ष भएपछि थप मोड्युलहरू खुल्छन् ▬▬▶
